[
  {
    "Week": "1",
    "Title": "Presence with Allah",
    "Guidance": "This week is about living with awareness that Allah sees you in every moment. Presence begins when the heart slows down and remembers Who it stands before.",
    "Challenge": "Say SubhanAllah 1,000 times this week, spreading it across your days with focus."
  },
  {
    "Week": "2",
    "Title": "Gratitude",
    "Guidance": "Gratitude softens the heart and increases blessings. Noticing Allah's favors trains the soul to see abundance instead of lack.",
    "Challenge": "Say Alhamdulillah 5,000 times this week, reflecting on Allah's blessings as you do."
  },
  {
    "Week": "3",
    "Title": "Tawheed",
    "Guidance": "True peace comes from knowing that Allah alone controls benefit and harm. This week strengthens reliance on Him alone.",
    "Challenge": "Say La ilaha illa Allah 3,000 times this week, slowly and intentionally."
  },
  {
    "Week": "4",
    "Title": "Tawakkul",
    "Guidance": "Tawakkul is doing what you can, then trusting Allah with the outcome. Let go of the need to control what is not yours.",
    "Challenge": "Say HasbiAllahu la ilaha illa Huwa 1,000 times this week."
  },
  {
    "Week": "5",
    "Title": "Sabr",
    "Guidance": "Patience is restraint for Allah's sake. It is choosing calm over reaction and faith over frustration.",
    "Challenge": "Say La hawla wa la quwwata illa billah 1,000 times this week."
  },
  {
    "Week": "6",
    "Title": "Shukr Through Action",
    "Guidance": "True gratitude is shown through obedience and restraint from sin, not words alone.",
    "Challenge": "Guard all five daily prayers on time for the entire week."
  },
  {
    "Week": "7",
    "Title": "Seeking Forgiveness",
    "Guidance": "Returning to Allah cleans the heart and restores closeness, no matter how many times you return.",
    "Challenge": "Say Astaghfirullah 5,000 times this week."
  },
  {
    "Week": "8",
    "Title": "Hope in Allah",
    "Guidance": "Allah's mercy is greater than your mistakes. Hope protects the heart from despair.",
    "Challenge": "Read and reflect on Surah Az-Zumar (39:53) once daily this week."
  },
  {
    "Week": "9",
    "Title": "Taqwa",
    "Guidance": "Taqwa is being mindful of Allah before choices, words, and actions.",
    "Challenge": "Avoid one known doubtful or disliked action entirely for this week."
  },
  {
    "Week": "10",
    "Title": "Sincerity (Ikhlas)",
    "Guidance": "Worship is accepted when it is done for Allah alone, not for people or recognition.",
    "Challenge": "Perform one good deed in secret each day, known only to Allah."
  },
  {
    "Week": "11",
    "Title": "Love of Allah",
    "Guidance": "Love grows through obedience and remembrance, not emotion alone.",
    "Challenge": "Read Surah Al-Baqarah over the course of the week."
  },
  {
    "Week": "12",
    "Title": "Mindful Dhikr",
    "Guidance": "Dhikr with presence shapes the heart more than rushed repetition.",
    "Challenge": "Say SubhanAllah, Alhamdulillah, and Allahu Akbar 1,000 times each across the week."
  },
  {
    "Week": "13",
    "Title": "Reflection Before Reaction",
    "Guidance": "Pausing before reacting allows wisdom to lead instead of emotion.",
    "Challenge": "Remain silent for 10 seconds before responding when upset, all week."
  },
  {
    "Week": "14",
    "Title": "Patience with People",
    "Guidance": "Patience with people tests restraint, humility, and trust in Allah's justice.",
    "Challenge": "Say La hawla wa la quwwata illa billah 700 times this week, especially after moments of irritation."
  },
  {
    "Week": "15",
    "Title": "Gentleness",
    "Guidance": "Gentleness beautifies speech and action.",
    "Challenge": "Send salawat upon the Prophet ﷺ 1,000 times this week."
  },
  {
    "Week": "16",
    "Title": "Humility",
    "Guidance": "Humility grows when the servant recognizes dependence on Allah in every success.",
    "Challenge": "Pray Salat ad-Duha at least 4 times this week with gratitude."
  },
  {
    "Week": "17",
    "Title": "Forgiveness",
    "Guidance": "Forgiveness frees the heart before it frees others.",
    "Challenge": "Make dua daily for someone who wronged you."
  },
  {
    "Week": "18",
    "Title": "Self-Control",
    "Guidance": "Restraint strengthens the soul.",
    "Challenge": "Fast one voluntary day this week."
  },
  {
    "Week": "19",
    "Title": "Truthfulness",
    "Guidance": "Truthfulness aligns the tongue with the heart and strengthens sincerity.",
    "Challenge": "Recite Surah Al-Asr after one salah each day this week."
  },
  {
    "Week": "20",
    "Title": "Kindness",
    "Guidance": "Small acts done sincerely carry great weight with Allah.",
    "Challenge": "Give one act of charity this week, any amount."
  },
  {
    "Week": "21",
    "Title": "Lowering the Gaze",
    "Guidance": "Lowering the gaze is the first defense of the heart.",
    "Challenge": "Say Astaghfirullah 300 times daily for 7 days with the intention of guarding the gaze."
  },
  {
    "Week": "22",
    "Title": "Contentment",
    "Guidance": "Contentment brings peace to the heart.",
    "Challenge": "Say Alhamdulillah 1,000 times this week."
  },
  {
    "Week": "23",
    "Title": "Silence with Wisdom",
    "Guidance": "Silence becomes worship when it prevents harm and unnecessary speech.",
    "Challenge": "Read Surah Al-Hujurat slowly over two sittings this week."
  },
  {
    "Week": "24",
    "Title": "Good Assumptions",
    "Guidance": "Good assumptions purify the heart from suspicion and arrogance.",
    "Challenge": "Make dua after Maghrib every day this week for someone you struggle to think well of."
  },
  {
    "Week": "25",
    "Title": "Avoiding Sinful Habits",
    "Guidance": "Leaving sin opens doors to closeness with Allah.",
    "Challenge": "Completely avoid one specific habitual sin this week."
  },
  {
    "Week": "26",
    "Title": "Consistency",
    "Guidance": "Allah loves consistent deeds, even if small.",
    "Challenge": "Choose one daily act of worship and do it every day this week."
  },
  {
    "Week": "27",
    "Title": "Khushu in Salah",
    "Guidance": "Khushu increases when prayer is slowed and honored.",
    "Challenge": "Pray Fajr and Isha with slow, deliberate recitation throughout the week."
  },
  {
    "Week": "28",
    "Title": "Longer Sujood",
    "Guidance": "Sujood is where the servant is closest to Allah.",
    "Challenge": "Lengthen sujood in every prayer this week."
  },
  {
    "Week": "29",
    "Title": "Dua with Certainty",
    "Guidance": "Allah hears every sincere dua.",
    "Challenge": "Make dua after every obligatory salah this week."
  },
  {
    "Week": "30",
    "Title": "Quran as Guidance",
    "Guidance": "The Quran was revealed to be lived.",
    "Challenge": "Read 5 pages of Quran daily this week."
  },
  {
    "Week": "31",
    "Title": "Morning Barakah",
    "Guidance": "Early hours carry blessings.",
    "Challenge": "Read Quran after Fajr every day this week."
  },
  {
    "Week": "32",
    "Title": "Night Reflection",
    "Guidance": "Ending the day with Allah brings peace.",
    "Challenge": "Pray Witr every night this week."
  },
  {
    "Week": "33",
    "Title": "Voluntary Salah",
    "Guidance": "Extra prayers bring closeness.",
    "Challenge": "Pray 2 rakahs of voluntary prayer daily this week."
  },
  {
    "Week": "34",
    "Title": "Listening to Quran",
    "Guidance": "The Quran softens hearts when listened to attentively.",
    "Challenge": "Listen to 30 minutes of Quran daily this week."
  },
  {
    "Week": "35",
    "Title": "Allah's Names",
    "Guidance": "Calling Allah by His Names deepens dua.",
    "Challenge": "Learn one Name of Allah and use it in dua daily this week."
  },
  {
    "Week": "36",
    "Title": "Istighfar Lifestyle",
    "Guidance": "Seeking forgiveness keeps the heart clean.",
    "Challenge": "Say Astaghfirullah 1,000 times daily this week."
  },
  {
    "Week": "37",
    "Title": "Salawat",
    "Guidance": "Sending salawat connects the heart to the Prophet (saw)",
    "Challenge": "Send salawat 2,000 times this week."
  },
  {
    "Week": "38",
    "Title": "Witr with Presence",
    "Guidance": "Witr seals the night with sincerity.",
    "Challenge": "Pray Witr with three rakahs every night this week, extending the final sujood."
  },
  {
    "Week": "39",
    "Title": "Balance in Worship",
    "Guidance": "Balance preserves sincerity and prevents burnout.",
    "Challenge": "Maintain one existing sunnah act every day this week without adding new acts."
  },
  {
    "Week": "40",
    "Title": "Seeing Allah in Creation",
    "Guidance": "Creation points back to the Creator.",
    "Challenge": "Spend 10 minutes daily observing nature and saying SubhanAllah."
  },
  {
    "Week": "41",
    "Title": "Mindful Walking",
    "Guidance": "Movement can awaken spiritual awareness.",
    "Challenge": "Walk 15 minutes, four times this week, saying Allahu Akbar throughout."
  },
  {
    "Week": "42",
    "Title": "Honoring the Body",
    "Guidance": "The body is an amanah from Allah.",
    "Challenge": "Sleep early enough to pray Fajr on time every day this week."
  },
  {
    "Week": "43",
    "Title": "Protecting Your Time",
    "Guidance": "Time is a trust that disappears quickly.",
    "Challenge": "Replace 30 minutes daily of a time-waster with listening to Quran this week."
  },
  {
    "Week": "44",
    "Title": "Intentional Living",
    "Guidance": "Actions are judged by intentions.",
    "Challenge": "Say Bismillah before every major action this week."
  },
  {
    "Week": "45",
    "Title": "Serving Without Being Seen",
    "Guidance": "Hidden good deeds purify sincerity.",
    "Challenge": "Perform one hidden act of service this week."
  },
  {
    "Week": "46",
    "Title": "Dua for Loved Ones",
    "Guidance": "Dua strengthens bonds beyond words.",
    "Challenge": "Make dua daily for family members by name this week."
  },
  {
    "Week": "47",
    "Title": "Healing the Heart",
    "Guidance": "Hearts heal when turned toward Allah consistently.",
    "Challenge": "Pray 2 rakahs before sleeping on at least 5 nights this week asking Allah for peace."
  },
  {
    "Week": "48",
    "Title": "Letting Go of Control",
    "Guidance": "Surrender brings peace where control creates anxiety.",
    "Challenge": "Say HasbiAllahu la ilaha illa Huwa 500 times this week."
  },
  {
    "Week": "49",
    "Title": "Remembering the Akhirah",
    "Guidance": "The Hereafter clarifies priorities.",
    "Challenge": "Read Surah Al-Mulk every night this week."
  },
  {
    "Week": "50",
    "Title": "Living with Purpose",
    "Guidance": "Purpose comes from aligning life with faith.",
    "Challenge": "Avoid one major distraction that pulls you away from Allah this week."
  },
  {
    "Week": "51",
    "Title": "Review and Repentance",
    "Guidance": "Repentance is a return, not a punishment.",
    "Challenge": "Pray 2 rakahs of repentance and read Surah Az-Zumar (39:53) once this week."
  },
  {
    "Week": "52",
    "Title": "Renewal and Intention",
    "Guidance": "Every return to Allah is a new beginning.",
    "Challenge": "Renew your intentions daily and say Astaghfirullah 1,000 times this week."
  }
]